[
  {
    "id": "User",
    "pref_label": {
      "en": "User",
      "fr": "Utilisateur"
    },
    "comment": {
      "en": "Concept encompassing individuals or agents who interact with the HPC system, including identity attributes, roles, permissions, and user behaviors.",
      "fr": "Concept englobant les individus ou agents qui interagissent avec le système HPC, y compris les attributs d'identité, les rôles, les autorisations et les comportements des utilisateurs."
    }
  },
  {
    "id": "Authentication",
    "pref_label": {
      "en": "Authentication Event",
      "fr": "Événement d'authentification"
    },
    "comment": {
      "en": "Domain concept representing all aspects of authentication, including credentials, access protocols, identity validation, and login activities.",
      "fr": "Concept décrivant tous les aspects de l'authentification, y compris les identifiants, les protocoles d'accès, la validation d'identité et les activités de connexion."
    }
  },
  {
    "id": "WorkflowOntology",
    "pref_label": {
      "en": "Workflow Ontology",
      "fr": "Ontology de flux de travail"
    },
    "comment": {
      "en": "The Workflow Ontology provides a unified, semantically rich model to describe computational workflows, workflow management systems (WMS), and workflow execution semantics.   It bridges diverse workflow ecosystems such as CWL, WDL, Apache Airflow, Apache NiFi and Python pased workflows, ensuring interoperability, and FAIR compliance. A workflow defines a set of interconnected steps or actions that process data, allocate resources, and produce outputs. It encompasses definitions from workflow engines (e.g., CWL, NiFi, Python), manages input/output parameters, orchestrates execution order, and interacts with HPC environments. Workflows facilitate reproducibility and enable provenance tracking for FAIR research practices."
    }
  },
  {
    "id": "Job",
    "pref_label": {
      "en": "Job",
      "fr": "Tâche"
    },
    "comment": {
      "en": "Concept that includes computational tasks, job descriptions, submission metadata, scheduling attributes, and runtime behavior in HPC environments.",
      "fr": "Concept couvrant les tâches informatiques, les descriptions de tâches, les métadonnées de soumission, les attributs de planification et le comportement à l'exécution dans les environnements HPC."
    }
  },
  {
    "id": "HPCResource",
    "pref_label": {
      "en": "HPC Resource",
      "fr": "Ressource HPC"
    },
    "comment": {
      "en": "Conceptual class encompassing physical and virtual resources involved in high-performance computing, including compute nodes, storage, interconnects, and infrastructure components.",
      "fr": "Classe conceptuelle englobant les ressources physiques et virtuelles utilisées dans le calcul haute performance, comme les nœuds de calcul, le stockage, les interconnexions et les composants d'infrastructure."
    }
  },
  {
    "id": "ProcessorIndicatorEstimator",
    "pref_label": {
      "en": "Processor Indicator Estimator",
      "fr": "Estimateur d’indicateurs du processeur"
    },
    "comment": {
      "en": "Concept grouping all estimation tools, metrics, and models used to assess processor-related indicators such as power consumption, thermal footprint, and die size impact.",
      "fr": "Concept regroupant tous les outils, métriques et modèles d’estimation des indicateurs liés au processeur, comme la consommation d’énergie, l’empreinte thermique et l’impact de la taille de la puce."
    }
  },
  {
  "id": "DigitalTwin",
  "pref_label": {
      "en": "Digital Twin",
      "fr": "Jumeau Numérique"
       },
   "comment":{
         "en": "Represents a virtual representation of a physical or logical entity.",
         "fr": "Représente une représentation virtuelle d'une entité physique ou logique."
    }
  }, 
    {
  "id": "WorkflowProperty",
  "pref_label": {
    "en": "Workflow Property",
    "fr": "Propriété du flux de travail"
  },
  "comment": {
    "en": "An abstract concept grouping all categorical properties used to describe workflows, including flow type, coupling, granularity, domain specificity, and orchestration characteristics.",
    "fr": "Concept abstrait regroupant toutes les propriétés catégorielles utilisées pour décrire les flux de travail, y compris le type de flux, le couplage, la granularité, la spécificité du domaine et les caractéristiques d'orchestration."
  }
    },
  {
    "id": "PhysicalCharacteristic",
    "pref_label": {
      "en": "Physical Characteristic",
      "fr": "Caractéristique physique"
    },
    "comment": {
      "en": "Domain concept capturing the physical and structural properties of HPC components, such as memory capacity, die size, material lifetime, and energy efficiency attributes.",
      "fr": "Concept représentant les propriétés physiques et structurelles des composants HPC, telles que la capacité mémoire, la taille de la puce, la durée de vie du matériel et les attributs d’efficacité énergétique."
    }
  }
]
