[
  {
    "id": "PowerUsageEffectiveness",
    "pref_label": {
      "en": "Power Usage Effectiveness (PUE)",
      "fr": "Efficacité d'utilisation de l'énergie (PUE)"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Industry standard metric for measuring data center energy efficiency, defined as the ratio of total facility energy to IT equipment energy.",
	"fr": "Indicateur standard pour mesurer l'efficacité énergétique d'un centre de données, défini comme le rapport entre énergie injectée dans un parc de serveur, et l'énergie réellement utilisée pour alimenter les serveurs."
    }
  },
  {
    "id": "ImpactFactor",
    "pref_label": {
      "en": "Impact Factor",
      "fr": "Facteur d'impact"
    },
    "comment": {
      "en": "Multiplicative coefficient used to compute the environmental impact associated with processor attributes like die size.",
	"fr": "Coefficient multiplicatif utilisé pour calculer l’impact environnemental lié aux caractéristiques du processeur comme la taille de la puce."
    }
  },
  {
    "id": "AllocationMethod",
    "pref_label": {
      "en": "Allocation Method",
      "fr": "Méthode d’allocation"
    },
    "comment": {
      "en": "Method or function to distribute embodied impacts across multiple jobs or workflows.",
      "fr": "Méthode ou fonction permettant de répartir les impacts incorporés entre plusieurs tâches ou workflows."
    }
  },
  {
    "id": "EnergyConsumption",
    "pref_label": {
      "en": "Energy Consumption",
      "fr": "Consommation d’énergie"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Measurement or estimation of the energy consumed by computing and supporting hardware.",
      "fr": "Mesure ou estimation de l'énergie consommée par le matériel informatique et les équipements de support."
    }
  },
  {
    "id": "EnergyEfficiencyMetric",
    "pref_label": {
      "en": "Energy Efficiency Metric",
      "fr": "Indicateur d'efficacité énergétique"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Metric for evaluating how efficiently energy is used during HPC operations.",
      "fr": "Indicateur permettant d’évaluer l’efficacité de l’utilisation de l’énergie pendant les opérations de calcul haute performance."
    }
  },
  {
    "id": "EnvironmentalImpact",
    "pref_label": {
      "en": "Environmental Impact",
      "fr": "Impact environnemental"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Quantitative or qualitative assessment of the environmental effects of HPC systems throughout their lifecycle.",
      "fr": "Évaluation quantitative ou qualitative des effets environnementaux des systèmes HPC tout au long de leur cycle de vie."
    }
  },
  {
    "id": "EmbodiedImpact",
    "pref_label": {
      "en": "Embodied Impact",
      "fr": "Impact incorporé"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Environmental impact associated with manufacturing, transport, and deployment of HPC hardware.",
      "fr": "Impact environnemental lié à la fabrication, au transport et au déploiement du matériel HPC."
    }
  },
  {
    "id": "UsageImpact",
    "pref_label": {
      "en": "Usage Impact",
      "fr": "Impact en usage"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Environmental impact from the operational phase of HPC systems, including energy usage and emissions.",
      "fr": "Impact environnemental lié à la phase d’utilisation des systèmes HPC, y compris la consommation d’énergie et les émissions."
    }
  },
  {
    "id": "WorkloadEstimator",
    "pref_label": {
      "en": "Workload Estimator",
      "fr": "Estimateur de charge"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Tool or method for estimating and analyzing the workload executed on HPC systems.",
      "fr": "Outil ou méthode permettant d’estimer et d’analyser la charge de travail exécutée sur les systèmes HPC."
    }
  },
  {
    "id": "LifetimeEstimator",
    "pref_label": {
      "en": "Lifetime Estimator",
      "fr": "Estimateur de durée de vie"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Tool or model for predicting the operational lifetime of hardware components.",
      "fr": "Outil ou modèle permettant de prédire la durée de vie opérationnelle des composants matériels."
    }
  },
  {
    "id": "PerformanceIndicator",
    "pref_label": {
      "en": "Performance Indicator",
      "fr": "Indicateur de performance"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Metric used to evaluate the computational performance of HPC systems.",
      "fr": "Indicateur permettant d’évaluer la performance de calcul des systèmes HPC."
    }
  },
  {
    "id": "CarbonFootprint",
    "pref_label": {
      "en": "Carbon Footprint",
      "fr": "Empreinte carbone"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Measurement of the greenhouse gas emissions associated with HPC system usage.",
      "fr": "Mesure des émissions de gaz à effet de serre liées à l’utilisation des systèmes HPC."
    }
  },
  {
    "id": "ResourceUtilization",
    "pref_label": {
      "en": "Resource Utilization",
      "fr": "Utilisation des ressources"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Indicates how effectively computing resources are being used over time.",
      "fr": "Indique dans quelle mesure les ressources informatiques sont utilisées efficacement au fil du temps."
    }
  },
  {
    "id": "ThermalEstimator",
    "pref_label": {
      "en": "Thermal Estimator",
      "fr": "Estimateur thermique"
    },
    "parent_class": "ProcessorIndicatorEstimator",
    "comment": {
      "en": "Tool for estimating heat production and cooling requirements of HPC components.",
      "fr": "Outil permettant d’estimer la production de chaleur et les besoins en refroidissement des composants HPC."
    }
  }
]
